
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.stored64[&#34;scheduler-execution&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.stored64["scheduler-execution"] must be replaced
-/+ resource "azurerm_key_vault_secret" "stored64" {
      ~ id                      = "https://juror-stg.vault.azure.net/secrets/job-SERVICE-SECRET/8242db844f8c48048b64a1a54c0254e9" -> (known after apply)
      ~ name                    = "job-SERVICE-SECRET" -> "scheduler-execution-SECRET" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/job-SERVICE-SECRET/versions/8242db844f8c48048b64a1a54c0254e9" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/job-SERVICE-SECRET" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "8242db844f8c48048b64a1a54c0254e9" -> (known after apply)
      ~ versionless_id          = "https://juror-stg.vault.azure.net/secrets/job-SERVICE-SECRET" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":25,"Program":"tfcmt","SHA1":"","Vars":{}} -->